{
    //
    // See the usage-message of 'harpwise jamming' for instructions on how to use this
    // file; in short:
    //
    //                    harpwise jam along 12bar
    //

    //
    // See remarks at the end of file this file, on how to create your own jamming.
    // (once you have tried this one and maybe want your own backing track ...)
    //

    //
    // The remaining comments (lots of them !) explain the individual parameters within this
    // file; you dont need to read them, if you just want to jam.  Read on, only if you want
    // to create a new jam.
    //
    
    // Track to play, can be anything playable by sox; %{install_dir} (used below) is the
    // installation-directory of harpwise; the track 12bar.mp3 comes included with harpwise.
    "sound_file": "%{install_dir}/recordings/12bar.mp3",
    "sound_file_key": "g",
    "harp_key": "c",
    // Description should be an orientation for the user; can be either a string or an
    // array of strings; the description below is rather long and gives an overview of
    // the whole process of jamming
    "description": ["A 12-bar backing-track and the 3-lick set 'box1' (or 'box2').",
		    "",
		    "Each of the licks is one bar long, and matches one of chords I,IV,V. Play each lick as long as it is displayed, e.g. play the first lick four times, then the second lick two times, etc.",
		    "",
		    "Note, that always the current, matching chord (scale) is highlighted in the harmonica-chart to hint on holes for improvisation.",
		    "",
		    "Play either with a mic or use earphones to help harpwise sense your playing even in the accustic presence of the backing track.",
		    "",
		    "This jam comes in two variations with box1 and box2."],
    // Example for user on how to start harpwise:
    // (this can be a single string or an array of strings,
    //  which would then be called 'variations'; see further
    //  down below for details on this)
    "example_harpwise": ["harpwise listen --scale-prog 12bar --lick-prog box1 --jamming",
			 "harpwise listen --scale-prog 12bar --lick-prog box2 --jamming"],
    // Global stretch (> 1) or compress (< 1) all timestamps; use this e.g. if you have
    // slowed down the backing track after creating timestamps:
    "timestamps_multiply": 1.0,
    // Globally add to all timestamps; value can be negative too (in which case it delays
    // playing); use this e.g. if you want to switch licks and scales early e.g. to read
    // the next lick in advance:
    "timestamps_add": -0.2,
    // Maybe give some extra time to grab your harp before anything starts. This acts on
    // both, backing track and actions:
    "sleep_initially": 2.0,
    // Use this, if actions and music tend to drift; can be negative too (in which case it
    // is just subtracted from last timestamp) For tracks with slightly uneven tempo, or to
    // make room for a solo, this can also be an array, e.g. [0, 0.2, 0, 12, 0, -0.1], which
    // might also include appropriate messages, e.g. [0, 0.2, 0, [12, "solo"], 0, -0.1]. The
    // last value of this array is reused, if the array is smaller than number of iterations:
    "sleep_after_iteration": -0.1,
    //
    // The array "timestamps_to_actions" below is the central data structure of this file.
    // it is an array, where each element has one of these forms:
    //
    //   [timestamp, "message", message, secs_to_show]
    //   [timestamp, "keys", key1, key2, ... ]
    //   [timestamp, "loop-start", message, secs_to_show] 
    //   [timestamp, "timer"]
    //   [timestamp, "timer", "secs_to_elapse"]
    //
    // Where:
    //
    // "timestamp" is the number of seconds after start of backing track. It may also be 0,
    // which means to repeat the preceding timestamp. A negative value is relative to the
    // following timestamp. See some comments below in "timestamps_to_actions".
    //
    // "message" makes the given message appear in "harpwise listen" for secs_to_show
    // seconds; secs_to_show is optional and defaults to 2. In any case the next message
    // given here will override its predecessor, so you rarely need to set this.
    // If a message starts with a tar '*' it is printed in a different color, which
    // may e.g. help the user to spot messages about coming chord changes.
    //
    // "keys" sends the given keys to "harpwise listen", mostly for switching scales and
    // licks or for doing a reset initially; hence "l","s","L","S" will be the the most
    // frequent (only ?) choices..
    //
    // "loop-start" is just like "message" but also marks the entrypoint for the second and
    // any further iterations, so that action before "loop-start" are only executed once.
    //
    // "timer" initiates a timer, that is shown in the topmost line of "harpwise listen" and
    // may be used to indicate a time-span, typically up to the next chord change.
    // If there is no string after "timer", harpwise calculates and uses the duration
    // up to the next timer.  However, you may also specify an explicit duration as a
    // number.
    // 
    // The array timestamps-to-actions will be repeated forever, but from the second
    // iteration on it will start at "loop-start".  This assumes that the chord-structure
    // of your song repeats in a regular fashion too.
    //
    //
    // Messages to be shown (and most other strings), may use these special variables:
    //
    //   %{description}         :  description from this file
    //   %{iteration}           :  count of repeats (whole set of actions)
    //   %{iteration_max}       :  total number of iterations (calculated from track length)
    //   %{iteration_duration}  :  duration of one iteration (secs)
    //   %{elapsed}             :  time elapsed (mm:ss)
    //   %{remaining}           :  time remaining of backing-track (mm:ss)
    //   %{install_dir}         :  installation directory of harpwise
    //   %{loop_starter}        :  convenient message for loop start including iteration, elapsed, etc.
    //
    // These variables are updated for each iteration, but keep their values during one.
    //

    //
    // Some details on how 'harpwise jamming' will use some of the parameters abvove to
    // transform the timestamps below:
    //
    //   - timestamps_add
    //     - if positive, add it to each timestamp
    //     - if negative, delay track accordingly
    //   - sleep_after_iteration
    //     - if < 1, subtract it from last timestamp only
    //     - if >= 1, add a new explicit sleep-action
    //     - if an array (numbers only or pairs [number, text]), use each element
    //       one after the other for the current iteration as described above;
    //       issue text (e.g. 'solo'), if given
    //   - timestamps_multiply: multiply each timestamp with this\e[0m
    //    
    "timestamps_to_actions": [
	// Sending "L" and "S" resets licks-progression and scale to their initial value, so
	// that the same instance of "harpwise listen" can be used multiple times:
        [0,"keys","L","S"],
	[0,"timer"],
	// Negative timestamp is subtraced from the follwing one (i.e. 6 - 2):
        [-2,"message","*In two secs ..."],
	// Exactly one loop-start is needed:
        [6,"loop-start","%{loop_starter}",4],
	// Timestamp of zero below, means to repeat the preceding one (i.e. "6"):
	[0,"timer"],
        [-2,"message","*Chord-change in two secs ...",2],
	// These two keys will switch lick- and scale-progression in unison:
        [18,"keys","l","s"],
	[0,"timer"],
        [-2,"message","*Chord-change in two secs ...",2],
        [24,"keys","l","s"],
	[0,"timer"],
        [-2,"message","*Three chord-changes in two secs ...",2],
        [30,"keys","l","s"],
	[0,"timer"],
        [33,"keys","l","s"],
        [36,"keys","l","s"],
	[0,"timer"],
        [-2,"message","*Turnaround in two secs ...",2],
        [42,"keys","l","s"]
    ]
}


// 
//  How to create your own jam ?
//  ============================
//  
//  After some practice with the backing-track 12bar.mp3 you may want to try one of your own
//  backing-tracks. A suitable track needs to have a regular chord-structure, probably with
//  an intro and maybe a solo.
//
//  To make a jam from such a track, you will need to prepare a new json-file using your
//  favorite text-editor plus a few tools described below. For starters you may choose a
//  simple 12-bar track with regular chord-changes (I-IV-I-V-IV-I), so that the structure
//  will be very similar to 12bar.json. You may name your new json-file loosely after the
//  backing track.
//
//  First, make a copy of 12bar.json, name it after your backing-track and put in the
//  filename of your own track, mb adjust parameters 'description' and 'example_harpwise'.
//
//  In addition you will need to adjust the array 'timestamps_to_actions' in your new
//  json-file, so that the timestamps match chord-changes and the turn-around of your track.
//
//  To determine those timestamps for a new track, you may employ 'harpwise jam play' and
//  its ability to jump around in a track and mark timestamps. Press RETURN at chord-changes
//  and turnarounds or jump back 4 secs, if you missed a chord-change or jump from loop end
//  to end. As argument to 'harpwise jam play' you may give the json-file or the name of
//  your mp3; the resuling set of timestamps will be displayed and written to disk.
//
//  If you want more graphical tools to get timestamps for chord changes, you may try
//  audacity or transcribe. Both are excellent tools with broad (but different) areas of
//  expertise. And both allow to mark and export timestamps along the waveform.
//
//  Once you have your timestamps you need to enter them into your json-file; for a
//  quick and silent check you may try 'harpwise jam along FILE.json --print-only'.
//
//  After putting in your timestamps, you should try your new json with 'harpwise jam along'
//  and check, if the actions executed are in sync with your track. It can be useful to keep
//  watching the output of 'harpwise jam along' instead of 'harpwise listen' for this
//  check. If necessary, do some overall adjustments:
//
//  - If all timestamps seem to be off by a certain constant amount, try parameter
//    'timestamps_add' (negative or positive)
//
//  - If timestamps tend to drift from turnaround to turnaround, or if there are solos in
//    between, adjust parameter 'sleep_after_iteration', which is described above.
//
//  Once you have gone through these steps, everything should be ready for a new jam.
//
//
//  Creating variations of a jam
//  ----------------------------
//  
//  You may notice, that a single backing track can work well with different
//  lick-progressions.  One would call this a variation of a jam; to choose between them,
//  use parameter '--variation'.
//  
//  Such a case can easily be coded into your existing json-file: Just turn the parameter
//  "example_harpwise" into an array, where each example-element is a commandline that
//  specifies a different lick-progression.
//
//  And as lick-progressions in general can have different lengths, you may need to adjust
//  the "keys"-actions to send fewer or more characters "l". For this, turn
//  e.g. [24,"keys","l","s"] into [24,"keys",["l",""],"s"] (or in detail "l" into ["l",""])
//  This would send the key "l" in the first variation of the jam, but not in the second.
//

//
//    Have fun !
//
